ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f6638.h
#define DMA5TSEL__DMA_REQ    (0x0000)  /* DMA channel 5 transfer select 0:  DMA_REQ (sw) */
#define DMA5TSEL__TA0CCR0    (0x0100)  /* DMA channel 5 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA5TSEL__TA0CCR2    (0x0200)  /* DMA channel 5 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA5TSEL__TA1CCR0    (0x0300)  /* DMA channel 5 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA5TSEL__TA1CCR2    (0x0400)  /* DMA channel 5 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA5TSEL__TA2CCR0    (0x0500)  /* DMA channel 5 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA5TSEL__TA2CCR2    (0x0600)  /* DMA channel 5 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA5TSEL__TB0CCR0    (0x0700)  /* DMA channel 5 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA5TSEL__TB0CCR2    (0x0800)  /* DMA channel 5 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA5TSEL__RES9       (0x0900)  /* DMA channel 5 transfer select 9:  Reserved */
#define DMA5TSEL__RES10      (0x0A00) /* DMA channel 5 transfer select 10: Reserved */
#define DMA5TSEL__RES11      (0x0B00) /* DMA channel 5 transfer select 11: Reserved */
#define DMA5TSEL__RES12      (0x0C00) /* DMA channel 5 transfer select 12: Reserved */
#define DMA5TSEL__RES13      (0x0D00) /* DMA channel 5 transfer select 13: Reserved */
#define DMA5TSEL__RES14      (0x0E00) /* DMA channel 5 transfer select 14: Reserved */
#define DMA5TSEL__RES15      (0x0F00) /* DMA channel 5 transfer select 15: Reserved */
#define DMA5TSEL__USCIA0RX   (0x1000) /* DMA channel 5 transfer select 16: USCIA0 receive */
#define DMA5TSEL__USCIA0TX   (0x1100) /* DMA channel 5 transfer select 17: USCIA0 transmit */
#define DMA5TSEL__USCIB0RX   (0x1200) /* DMA channel 5 transfer select 18: USCIB0 receive */
#define DMA5TSEL__USCIB0TX   (0x1300) /* DMA channel 5 transfer select 19: USCIB0 transmit */
#define DMA5TSEL__USCIA1RX   (0x1400) /* DMA channel 5 transfer select 20: USCIA1 receive */
#define DMA5TSEL__USCIA1TX   (0x1500) /* DMA channel 5 transfer select 21: USCIA1 transmit */
#define DMA5TSEL__USCIB1RX   (0x1600) /* DMA channel 5 transfer select 22: USCIB1 receive */
#define DMA5TSEL__USCIB1TX   (0x1700) /* DMA channel 5 transfer select 23: USCIB1 transmit */
#define DMA5TSEL__ADC12IFG   (0x1800) /* DMA channel 5 transfer select 24: ADC12IFGx */
#define DMA5TSEL__DAC12_0IFG (0x1900) /* DMA channel 5 transfer select 25: DAC12_0IFG */
#define DMA5TSEL__DAC12_1IFG (0x1A00) /* DMA channel 5 transfer select 26: DAC12_1IFG */
#define DMA5TSEL__USB_FNRXD  (0x1B00) /* DMA channel 5 transfer select 27: USB FNRXD */
#define DMA5TSEL__USB_READY  (0x1C00) /* DMA channel 5 transfer select 28: USB ready */
#define DMA5TSEL__MPY        (0x1D00) /* DMA channel 5 transfer select 29: Multiplier ready */
#define DMA5TSEL__DMA4IFG    (0x1E00) /* DMA channel 5 transfer select 30: previous DMA channel DMA4IFG */
#define DMA5TSEL__DMAE0      (0x1F00) /* DMA channel 5 transfer select 31: ext. Trigger (DMAE0) */



/*************************************************************
* Flash Memory
*************************************************************/
#define __MSP430_HAS_FLASH__         /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_FLASH__ 0x0140
#define FLASH_BASE __MSP430_BASEADDRESS_FLASH__

#define FCTL1_                0x0140    /* FLASH Control 1 */
sfrb(FCTL1_L , FCTL1_);
sfrb(FCTL1_H , FCTL1_+1);
sfrw(FCTL1, FCTL1_);
//sfrbw    FCTL2                  (0x0142)  /* FLASH Control 2 */
#define FCTL3_                0x0144    /* FLASH Control 3 */
sfrb(FCTL3_L , FCTL3_);
sfrb(FCTL3_H , FCTL3_+1);
sfrw(FCTL3, FCTL3_);
#define FCTL4_                0x0146    /* FLASH Control 4 */
sfrb(FCTL4_L , FCTL4_);
sfrb(FCTL4_H , FCTL4_+1);
sfrw(FCTL4, FCTL4_);

#define FRPW                (0x9600)  /* Flash password returned by read */
#define FWPW                (0xA500)  /* Flash password for write */
#define FXPW                (0x3300)  /* for use with XOR instruction */
#define FRKEY               (0x9600)  /* (legacy definition) Flash key returned by read */
#define FWKEY               (0xA500)  /* (legacy definition) Flash key for write */
#define FXKEY               (0x3300)  /* (legacy definition) for use with XOR instruction */

/* FCTL1 Control Bits */
//#define RESERVED            (0x0001)  /* Reserved */
#define ERASE               (0x0002)  /* Enable bit for Flash segment erase */
#define MERAS               (0x0004)  /* Enable bit for Flash mass erase */
//#define RESERVED            (0x0008)  /* Reserved */
//#define RESERVED            (0x0010)  /* Reserved */
#define SWRT                (0x0020)  /* Smart Write enable */
#define WRT                 (0x0040)  /* Enable bit for Flash write */
#define BLKWRT              (0x0080)  /* Enable bit for Flash segment write */

/* FCTL1 Control Bits */
//#define RESERVED            (0x0001)  /* Reserved */
#define ERASE_L             (0x0002)  /* Enable bit for Flash segment erase */
#define MERAS_L             (0x0004)  /* Enable bit for Flash mass erase */
//#define RESERVED            (0x0008)  /* Reserved */
//#define RESERVED            (0x0010)  /* Reserved */
#define SWRT_L              (0x0020)  /* Smart Write enable */
#define WRT_L               (0x0040)  /* Enable bit for Flash write */
#define BLKWRT_L            (0x0080)  /* Enable bit for Flash segment write */


/* FCTL3 Control Bits */
#define BUSY                (0x0001)  /* Flash busy: 1 */
#define KEYV                (0x0002)  /* Flash Key violation flag */
#define ACCVIFG             (0x0004)  /* Flash Access violation flag */
#define WAIT                (0x0008)  /* Wait flag for segment write */
#define LOCK                (0x0010)  /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX                (0x0020)  /* Flash Emergency Exit */
#define LOCKA               (0x0040)  /* Segment A Lock bit: read = 1 - Segment is locked (read only) */
//#define RESERVED            (0x0080)  /* Reserved */

/* FCTL3 Control Bits */
#define BUSY_L              (0x0001)  /* Flash busy: 1 */
#define KEYV_L              (0x0002)  /* Flash Key violation flag */
#define ACCVIFG_L           (0x0004)  /* Flash Access violation flag */
#define WAIT_L              (0x0008)  /* Wait flag for segment write */
#define LOCK_L              (0x0010)  /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX_L              (0x0020)  /* Flash Emergency Exit */
#define LOCKA_L             (0x0040)  /* Segment A Lock bit: read = 1 - Segment is locked (read only) */
//#define RESERVED            (0x0080)  /* Reserved */


/* FCTL4 Control Bits */
#define VPE                 (0x0001)  /* Voltage Changed during Program Error Flag */
#define MGR0                (0x0010)  /* Marginal read 0 mode. */
#define MGR1                (0x0020)  /* Marginal read 1 mode. */
#define LOCKINFO            (0x0080)  /* Lock INFO Memory bit: read = 1 - Segment is locked (read only) */

/* FCTL4 Control Bits */
#define VPE_L               (0x0001)  /* Voltage Changed during Program Error Flag */
#define MGR0_L              (0x0010)  /* Marginal read 0 mode. */
#define MGR1_L              (0x0020)  /* Marginal read 1 mode. */
#define LOCKINFO_L          (0x0080)  /* Lock INFO Memory bit: read = 1 - Segment is locked (read only) */


/************************************************************
* LCD_B
************************************************************/
#define __MSP430_HAS_LCD_B__          /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_LCD_B__ 0x0A00
#define LCD_B_BASE __MSP430_BASEADDRESS_LCD_B__

#define LCDBCTL0_             0x0A00    /* LCD_B Control Register 0 */
sfrb(LCDBCTL0_L , LCDBCTL0_);
sfrb(LCDBCTL0_H , LCDBCTL0_+1);
sfrw(LCDBCTL0, LCDBCTL0_);
#define LCDBCTL1_             0x0A02    /* LCD_B Control Register 1 */
sfrb(LCDBCTL1_L , LCDBCTL1_);
sfrb(LCDBCTL1_H , LCDBCTL1_+1);
sfrw(LCDBCTL1, LCDBCTL1_);
#define LCDBBLKCTL_           0x0A04    /* LCD_B blinking control register */
sfrb(LCDBBLKCTL_L , LCDBBLKCTL_);
sfrb(LCDBBLKCTL_H , LCDBBLKCTL_+1);
sfrw(LCDBBLKCTL, LCDBBLKCTL_);
#define LCDBMEMCTL_           0x0A06    /* LCD_B memory control register */
sfrb(LCDBMEMCTL_L , LCDBMEMCTL_);
sfrb(LCDBMEMCTL_H , LCDBMEMCTL_+1);
sfrw(LCDBMEMCTL, LCDBMEMCTL_);
#define LCDBVCTL_             0x0A08    /* LCD_B Voltage Control Register */
sfrb(LCDBVCTL_L , LCDBVCTL_);
sfrb(LCDBVCTL_H , LCDBVCTL_+1);
sfrw(LCDBVCTL, LCDBVCTL_);
#define LCDBPCTL0_            0x0A0A    /* LCD_B Port Control Register 0 */
sfrb(LCDBPCTL0_L , LCDBPCTL0_);
sfrb(LCDBPCTL0_H , LCDBPCTL0_+1);
sfrw(LCDBPCTL0, LCDBPCTL0_);
#define LCDBPCTL1_            0x0A0C    /* LCD_B Port Control Register 1 */
sfrb(LCDBPCTL1_L , LCDBPCTL1_);
sfrb(LCDBPCTL1_H , LCDBPCTL1_+1);
sfrw(LCDBPCTL1, LCDBPCTL1_);
#define LCDBPCTL2_            0x0A0E    /* LCD_B Port Control Register 2 */
sfrb(LCDBPCTL2_L , LCDBPCTL2_);
sfrb(LCDBPCTL2_H , LCDBPCTL2_+1);
sfrw(LCDBPCTL2, LCDBPCTL2_);
#define LCDBPCTL3_            0x0A10    /* LCD_B Port Control Register 3 */
sfrb(LCDBPCTL3_L , LCDBPCTL3_);
sfrb(LCDBPCTL3_H , LCDBPCTL3_+1);
sfrw(LCDBPCTL3, LCDBPCTL3_);
#define LCDBCPCTL_            0x0A12    /* LCD_B Charge Pump Control Register 3 */
sfrb(LCDBCPCTL_L , LCDBCPCTL_);
sfrb(LCDBCPCTL_H , LCDBCPCTL_+1);
sfrw(LCDBCPCTL, LCDBCPCTL_);
#define LCDBIV_               0x0A1E    /* LCD_B Interrupt Vector Register */
sfrw(LCDBIV, LCDBIV_);

